Table of Contents
 Class CheckSectionExtreme
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Check section extreme base class
public abstract class CheckSectionExtreme
Inheritance
object
CheckSectionExtreme
Derived
StagedCheckSectionExtreme
StandardCheckSectionExtreme
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CheckSectionExtreme()
Constructor
protected CheckSectionExtreme()
Properties
 Accidental
Accidental loading
public LoadingULS Accidental { get; set; }
Property Value
LoadingULS
 Characteristic
Characterictic loading
public LoadingSLS Characteristic { get; set; }
Property Value
LoadingSLS
 Description
Description of this extreme
public string Description { get; set; }
Property Value
string
 Fatigue
Quasi-Permanent loading
public FatigueLoading Fatigue { get; set; }
Property Value
FatigueLoading
 Frequent
Frequent loading
public LoadingSLS Frequent { get; set; }
Property Value
LoadingSLS
 Fundamental
Fundamental loading
public LoadingULS Fundamental { get; set; }
Property Value
LoadingULS
 QuasiPermanent
Quasi-Permanent loading
public LoadingSLS QuasiPermanent { get; set; }
Property Value
LoadingSLS
 Edit this page